---
kind: type
id: T:Autodesk.Revit.DB.HiddenLineViewsType
source: html/dce41548-8f37-e883-babe-feac3a9dd82d.htm
---
# Autodesk.Revit.DB.HiddenLineViewsType

An enumerated type listing all Hidden Line Views types of Print Setting.

## Syntax (C#)
```csharp
public enum HiddenLineViewsType
```